[
  {
    "image": "https://i.ibb.co/dwmjRbd9/eyestetix-studio-pk-X0-E7-E8pcc-unsplash.jpg",
    "title": "WhatsApp",
    "companyName": "Meta",
    "id": 1,
    "description": "A free messaging and voice/video calling app used globally.",
    "des": "WhatsApp is a globally recognized messaging platform developed by Meta, providing seamless communication for over a billion users worldwide. It supports text messaging, voice messages, video and voice calls, and multimedia sharing including images, documents, and location. Its end-to-end encryption ensures privacy, making it a secure option for both personal and professional use. WhatsApp also allows group chats, broadcast messages, disappearing messages, and status updates. WhatsApp Business offers features for companies to engage with customers through automated messages, product catalogs, and direct interactions. The platform is accessible across smartphones, desktops, and web browsers, with frequent updates adding new features such as animated stickers, enhanced security, and advanced group management tools. WhatsApp’s simple interface, reliability, and global reach make it a central hub for daily communication, social connection, and business operations, empowering users to stay connected anytime, anywhere.",
    "size": 65,
    "reviews": 12000000,
    "ratingAvg": 4.3,
    "downloads": 2000,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2200000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 5600000 }
    ]
  },
  {
    "image": "https://i.ibb.co/2Y73NRXC/alexander-shatov-I4p0-Fcj-DBJI-unsplash.jpg",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 2,
    "description": "Short-form video sharing platform with viral content.",
    "des": "TikTok, developed by ByteDance, is a highly popular short-form video platform that allows users to create, share, and explore creative content. The app’s algorithm curates videos based on user preferences, ensuring personalized entertainment. TikTok offers a wide range of tools for video creation, including filters, effects, music, and augmented reality elements. Users can engage with trending challenges, duets, and collaborative content, fostering creativity and social interaction. TikTok has become a platform for education, news, lifestyle, comedy, and marketing, allowing creators to build audiences and brands to reach potential customers. Safety features include content moderation, digital wellbeing tools, and privacy controls. With an intuitive interface and endless feed of content, TikTok encourages continuous engagement. Regular updates introduce new creative features, analytics for creators, and security improvements. TikTok’s global reach, engaging experience, and creative freedom have made it one of the most influential social media platforms worldwide.",
    
    "size": 90,
    "reviews": 8000000,
    "ratingAvg": 4.5,
    "downloads": 773,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1400000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 3400000 }
    ]
  },
  {
    "image": "https://i.ibb.co/rGSxwy2k/alexander-shatov-71-Qk8-ODIBko-unsplash.jpg",
    "title": "Instagram",
    "companyName": "Meta",
    "id": 3,
    "description": "Photo & video sharing social network.",
    "des": "Instagram is a visual-first social networking platform developed by Meta that allows users to share photos, videos, stories, reels, and live streams. It combines personal expression, creativity, and social networking in one platform. Users can explore trends, discover content, and interact through likes, comments, shares, and direct messaging. Instagram provides tools for editing content with filters, effects, and augmented reality features. It has become an essential platform for influencers, brands, and businesses, offering marketing, advertising, and engagement opportunities. The Explore page and algorithmic feed help users discover relevant content, communities, and creators worldwide. Instagram also emphasizes privacy and safety, with settings to control visibility and interactions. Frequent updates introduce new features such as shopping, monetization tools, enhanced creative options, and AI-powered recommendations. Instagram’s user-friendly interface and rich ecosystem of creative tools make it a hub for inspiration, social interaction, and business growth.",
    "size": 85,
    "reviews": 10000000,
    "ratingAvg": 4.4,
    "downloads": 817,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1600000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 4200000 }
    ]
  },
  {
    "image": "https://i.ibb.co/zHRPZGgq/dima-solomin-u-DH-g-Om6e-A4-unsplash.jpg",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 4,
    "description": "AI chatbot for asking questions and generating text.",
    "des": "ChatGPT, developed by OpenAI, is an advanced AI language model that engages users in human-like conversation and provides assistance with a wide range of tasks. It can answer questions, provide explanations, generate text, create content, write code, and offer suggestions. ChatGPT is useful for personal, educational, and professional purposes, including tutoring, idea generation, content creation, and workflow optimization. Businesses use it for customer support, automated responses, and content production. ChatGPT continuously improves through updates to enhance accuracy, understanding, and safety while minimizing harmful outputs. Its conversational interface allows natural interaction, making AI accessible to users of all skill levels. With its broad capabilities, ChatGPT empowers millions to perform tasks efficiently, explore ideas creatively, and enhance productivity in digital environments.",
    "size": 120,
    "reviews": 3000000,
    "ratingAvg": 4.7,
    "downloads": 278,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "image": "https://i.ibb.co/qY9cFmNz/appshunter-io-EBDli9e-Ea-M-unsplash.jpg",
    "title": "CapCut",
    "companyName": "Bytedance",
    "id": 5,
    "description": "Free video editor with effects, transitions, and music.",
    "des": "CapCut, developed by ByteDance, is a free video editing app that enables users to create high-quality videos using a range of editing tools. Users can trim, merge, and crop videos, add transitions, effects, text, and music to enhance content. The app supports slow motion, reverse playback, and advanced visual effects, making it suitable for both casual creators and professionals. CapCut’s intuitive interface ensures easy navigation, while templates and presets simplify complex editing tasks. The app is widely used for social media content creation, including TikTok and Instagram, offering seamless sharing options. CapCut regularly updates with new features, effects, and AI-driven tools to enhance user creativity. Its combination of flexibility, accessibility, and professional-quality output has made it a popular video editor for users worldwide.",
    "size": 150,
    "reviews": 4000000,
    "ratingAvg": 4.3,
    "downloads": 410,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1700000 }
    ]
  },
  {
    "image": "https://i.ibb.co/KjfLT3nr/dima-solomin-3pw-Mu6u-Vs-JI-unsplash.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 6,
    "description": "Cloud-based messaging app focused on speed and security.",
    "des": "Telegram is a cloud-based messaging app known for speed, security, and privacy. It supports text messaging, multimedia sharing, voice and video calls, and group chats with thousands of members. Telegram offers features such as channels for broadcasting content, bots for automation, and secret chats with end-to-end encryption. Its cross-platform accessibility allows users to communicate from smartphones, tablets, or desktops. Telegram also supports file sharing of large sizes and cloud storage for media. Security, privacy, and customization options make it popular among individuals and organizations seeking a reliable messaging platform. Regular updates add new features, enhance performance, and improve user experience. Telegram’s robust ecosystem and emphasis on privacy make it a preferred choice for secure and versatile communication worldwide.",
    "size": 60,
    "reviews": 2000000,
    "ratingAvg": 4.4,
    "downloads": 447,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 550000 }
    ]
  },
  {
    "image": "https://i.ibb.co/WWcdzxWP/alexander-shatov-f-Rjjn-N-8njo-unsplash.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Multimedia messaging app with ephemeral stories.",
    "des": "Snapchat is a multimedia messaging app developed by Snap Inc., known for its unique ephemeral messaging features. It allows users to send photos, videos, and messages that disappear after being viewed, fostering spontaneous and authentic communication. The platform includes Stories, where users can post content visible to their friends for 24 hours, and Spotlight, which showcases short-form videos from creators globally. Snapchat also offers augmented reality (AR) lenses and filters to enhance images and videos creatively, along with Bitmoji avatars for personalized interactions. Users can participate in group chats, video calls, and collaborative features such as shared Stories. Snapchat emphasizes privacy and control, allowing users to manage who can view content or contact them. The app is popular among younger audiences for its playful interface and interactive features, encouraging creative self-expression. Regular updates introduce new AR experiences, games, and tools to improve engagement and user experience. With its combination of privacy-focused messaging, multimedia sharing, and social interactivity, Snapchat has become a prominent social media platform for entertainment, communication, and creative expression worldwide.",
    "size": 110,
    "reviews": 5000000,
    "ratingAvg": 1.67,
    "downloads": 330,
    "ratings": [
      { "name": "1 star", "count": 3750000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 250000 }
    ]
  },
  {
    "image": "https://i.ibb.co/9mCRWKdm/alexander-shatov-w-qqwn5-O-4-I-unsplash.jpg",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 8,
    "description": "Music streaming service with millions of tracks.",
    "des": "Spotify, developed by Spotify Ltd., is a leading music streaming service offering access to millions of songs, albums, podcasts, and playlists. It allows users to listen to music online or offline, discover new content through personalized recommendations, curated playlists, and algorithm-driven suggestions. Spotify supports features such as collaborative playlists, music sharing, podcast subscriptions, and social integration, enabling users to connect and explore content together. Premium subscriptions provide ad-free listening, high-quality audio, offline playback, and exclusive releases. Spotify is accessible on smartphones, tablets, desktops, smart TVs, and smart speakers, providing a seamless cross-device experience. The platform leverages data analytics and AI to offer highly personalized listening experiences, including daily mixes, Discover Weekly, and release radar playlists. Artists and podcasters benefit from Spotify for distributing content, growing audiences, and monetizing their work. Continuous updates introduce new features, improve recommendations, and expand accessibility options. Spotify’s combination of vast content libraries, intuitive interface, and personalized experiences has made it one of the most popular music streaming services worldwide, catering to music lovers of all tastes.",
    "size": 100,
    "reviews": 7000000,
    "ratingAvg": 4.6,
    "downloads": 238,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "image": "https://i.ibb.co/tP8DLcSP/alexander-shatov-d4-a-CS3js-Q0-unsplash.jpg",
    "title": "Twitter",
    "companyName": "X Corp.",
    "id": 9,
    "description": "Microblogging platform for sharing short text updates.",
    "des": "Twitter, now operated by X Corp., is a microblogging platform that allows users to share short text updates called tweets. Users can follow others, retweet, like, and comment on posts, creating a dynamic and interactive social networking environment. Twitter supports multimedia content including images, videos, GIFs, and polls, enhancing engagement. The platform serves as a space for public discourse, breaking news, social commentary, and community building, allowing individuals, organizations, and governments to communicate directly with audiences worldwide. Hashtags, trending topics, and lists facilitate content discovery and engagement on global issues. Twitter emphasizes immediacy and connectivity, enabling real-time conversation and viral content sharing. Privacy settings allow users to manage visibility and interactions. Frequent updates improve features such as thread creation, spaces for live audio discussions, and enhanced analytics for creators. With its concise, rapid communication model and global reach, Twitter has become a key platform for social interaction, professional networking, information dissemination, and public engagement across diverse communities.",
    "size": 75,
    "reviews": 9000000,
    "ratingAvg": 4.2,
    "downloads": 650,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co/wFb4X50B/alexander-shatov-ni-Uk-Im-Zc-SP8-unsplash.jpg",
    "title": "YouTube",
    "companyName": "Google",
    "id": 10,
    "description": "Video sharing platform with global content creators.",
    "des": "YouTube, developed by Google, is the world’s leading video-sharing platform, allowing users to upload, watch, and share videos globally. It hosts content across diverse categories such as entertainment, education, music, gaming, tutorials, and vlogs. YouTube supports features including live streaming, video monetization, subscriptions, playlists, and personalized recommendations powered by AI. Content creators can engage audiences through comments, polls, premieres, and community posts, while analytics tools help track performance and optimize growth. YouTube Premium offers ad-free experiences, offline playback, and access to YouTube Music. Its accessibility across smartphones, tablets, desktops, smart TVs, and streaming devices ensures users can consume content anywhere. YouTube also serves as a platform for learning, marketing, and professional development, with creators leveraging it to build brands, businesses, and communities. Frequent updates improve the user interface, recommendation algorithms, safety measures, and creator tools. YouTube’s combination of vast content diversity, global reach, and community engagement has made it an indispensable platform for entertainment, education, and communication worldwide.",
    "size": 140,
    "reviews": 15000000,
    "ratingAvg": 4.6,
    "downloads": 2100,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5500000 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://i.ibb.co/hRMYDks8/mariia-shalabaieva-d64-gh-A-r-H4-unsplash.jpg",
    "title": "Facebook",
    "companyName": "Meta",
    "id": 11,
    "description": "Global social networking service connecting people.",
    "des": "Facebook, developed by Meta, is a global social networking service that connects people, communities, and businesses. Users can share posts, images, videos, and events, join groups, follow pages, and interact through likes, comments, and shares. Facebook provides tools for real-time messaging via Messenger, video calling, marketplace buying and selling, and live streaming. The platform’s algorithm curates content tailored to user interests, helping users discover relevant communities, news, and updates. Businesses use Facebook for marketing, advertising, customer engagement, and analytics through Facebook Pages and Ads Manager. Privacy settings allow users to control who can view posts and personal information, ensuring a secure social experience. Facebook continuously introduces features such as Stories, Reels, virtual events, and AI-driven recommendations to enhance engagement. Its intuitive interface, diverse functionality, and global reach make Facebook a cornerstone of online social interaction, community building, and digital marketing.",
    "size": 110,
    "reviews": 18000000,
    "ratingAvg": 4.1,
    "downloads": 2900,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 7300000 }
    ]
  },
  {
    "image": "https://i.ibb.co/twBXqTyK/mariia-shalabaieva-2h-GE8q-Hip-Fo-unsplash.jpg",
    "title": "Messenger",
    "companyName": "Meta",
    "id": 12,
    "description": "Messaging app for chats, calls, and media sharing.",
    "des": "Messenger, also developed by Meta, is a versatile messaging platform designed for instant communication and multimedia sharing. It allows users to send text messages, images, videos, voice recordings, GIFs, and stickers, as well as make voice and video calls. Messenger supports group conversations, polls, reactions, and interactive features, fostering collaboration and social interaction. It integrates seamlessly with Facebook, enabling users to communicate across platforms. Messenger includes security features such as encrypted messaging, privacy settings, and spam controls. It also supports chatbots, payment services, and business interactions, making it a practical tool for both personal and professional use. Frequent updates improve the app with new functionalities, enhanced media handling, and optimized performance. Messenger’s cross-platform accessibility, ease of use, and rich feature set make it a popular communication solution worldwide, connecting millions daily for social, professional, and entertainment purposes.",
    "size": 95,
    "reviews": 7000000,
    "ratingAvg": 4.3,
    "downloads": 900,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 2300000 }
    ]
  },
  {
    "image": "https://i.ibb.co/GhXVKvM/mariia-shalabaieva-V02us-4r-NE8-unsplash.jpg",
    "title": "Zoom",
    "companyName": "Zoom Inc.",
    "id": 13,
    "description": "Video conferencing app for meetings and webinars.",
    "des": "Zoom, developed by Zoom Inc., is a robust video conferencing platform that allows users to host and join high-quality video and audio meetings worldwide. It offers features like screen sharing, virtual backgrounds, breakout rooms, chat, and meeting recording, making it ideal for business, education, and personal use. Zoom is accessible across devices, including desktops, smartphones, and tablets, with easy scheduling and joining of meetings. Security features such as meeting passwords, waiting rooms, and encryption ensure privacy. Frequent updates improve performance, introduce new tools, and enhance the user experience. Its reliability, scalability, and intuitive interface make Zoom a leading choice for remote collaboration and virtual communication.",
    "size": 135,
    "reviews": 6000000,
    "ratingAvg": 4.5,
    "downloads": 520,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "image": "https://i.ibb.co/SwP8HV1S/rubaitul-azad-q-K8-Tu-Z7-T9-N4-unsplash.jpg",
    "title": "Google Maps",
    "companyName": "Google",
    "id": 14,
    "description": "Navigation and real-time traffic with satellite maps.",
    "des": "Google Maps, developed by Google, is a comprehensive navigation platform that provides real-time GPS navigation, traffic updates, transit information, and satellite imagery. Users can search for locations, get directions, explore local businesses, and discover nearby attractions. Google Maps supports street view, offline maps, and route planning for driving, walking, cycling, and public transportation. It also includes features such as live traffic conditions, reviews, photos, and business hours, helping users make informed decisions. Regular updates enhance map accuracy, introduce new navigation features, and improve overall user experience. Its global coverage and intelligent features make Google Maps an essential tool for everyday navigation and exploration.",
    "size": 120,
    "reviews": 11000000,
    "ratingAvg": 4.7,
    "downloads": 3100,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 3300000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://i.ibb.co/qfnd5T0/rubaitul-azad-Yhg-Kun-Ty-Sks-unsplash.jpg",
    "title": "Google Drive",
    "companyName": "Google",
    "id": 15,
    "description": "Cloud storage for files, images, and documents.",
    "des": "Google Drive, developed by Google, is a cloud storage platform that allows users to store, manage, and share files securely online. It supports documents, spreadsheets, presentations, photos, videos, and other file types, providing seamless access across devices. Google Drive integrates with Google Workspace apps like Docs, Sheets, and Slides for real-time collaboration, editing, and commenting. Users can control file permissions, share links, and work offline, ensuring flexibility and security. Regular updates enhance storage management, collaboration tools, and integration with third-party apps. Google Drive’s convenience, accessibility, and robust cloud features make it an essential solution for personal and professional file management.",
    "size": 105,
    "reviews": 8500000,
    "ratingAvg": 4.6,
    "downloads": 2200,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 2700000 },
      { "name": "5 star", "count": 4200000 }
    ]
  },
  {
    "image": "https://i.ibb.co/xtJ0d6s0/rubaitul-azad-UTzu-Xp1chy4-unsplash.jpg",
    "title": "Google Photos",
    "companyName": "Google",
    "id": 16,
    "description": "Cloud photo management with AI organization.",
    "des": "Google Photos, developed by Google, is a cloud-based photo and video management platform that organizes, stores, and backs up media files automatically. It uses AI technology to categorize photos, detect faces, and create albums, collages, and animations. Users can edit photos, apply filters, and share albums or individual media with others. Google Photos also provides search functionality to find images based on people, objects, or locations. Its integration with other Google services and mobile devices allows seamless backup and synchronization. Frequent updates improve AI features, storage optimization, and editing tools. Google Photos simplifies media organization and ensures users can access, share, and relive memories from anywhere.",
    "size": 118,
    "reviews": 7600000,
    "ratingAvg": 4.5,
    "downloads": 1980,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 3850000 }
    ]
  },
  {
    "image": "https://i.ibb.co/sppT808r/dima-solomin-UKAVi-H-h-FMk-unsplash.jpg",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 17,
    "description": "Inspiration and idea sharing with image boards.",
    "des": "Pinterest, developed by Pinterest Inc., is a visual discovery platform that allows users to find, save, and share ideas through images and videos called Pins. Users can explore topics like fashion, home decor, DIY, food, travel, and more, creating personalized boards to organize content. Pinterest provides inspiration for projects, planning, and creative exploration. Users can follow others, discover trends, and engage with a global community of creators. AI-powered recommendations help surface relevant content tailored to users’ interests. Regular updates improve the interface, search functionality, and sharing features. Pinterest’s emphasis on inspiration, creativity, and curation makes it a leading platform for idea discovery and lifestyle exploration.",
    "size": 88,
    "reviews": 4500000,
    "ratingAvg": 4.4,
    "downloads": 900,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 1800000 }
    ]
  },
  {
    "image": "https://i.ibb.co/hR6tP3vL/appshunter-io-Rv-Azjmys-KYk-unsplash.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 18,
    "description": "Community-based discussions on every topic.",
    "des": "Reddit, developed by Reddit Inc., is a community-driven discussion platform that allows users to share content, post questions, and participate in forums called subreddits. Topics range from technology, entertainment, and science to lifestyle, hobbies, and news. Users can upvote, downvote, comment, and engage with content, shaping the visibility of posts. Reddit fosters communities where users exchange information, debate ideas, and share experiences. Features such as AMA (Ask Me Anything), live threads, and moderation tools enhance engagement. Regular updates improve usability, content discovery, and community management. Reddit’s diverse communities and interactive features make it a hub for discussion, learning, and online engagement.",
    "size": 80,
    "reviews": 3900000,
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "image": "https://i.ibb.co/HTjDZ4dq/boliviainteligente-v-YM4y-Kn-D0-NU-unsplash.jpg",
    "title": "Disney+",
    "companyName": "Disney",
    "id": 19,
    "description": "Streaming platform with Disney, Marvel, and Pixar shows.",
    "des": "Disney+, developed by Disney, is a streaming service that offers movies, TV shows, and exclusive content from Disney, Pixar, Marvel, Star Wars, and National Geographic. Users can stream content on-demand across devices, create profiles, and access personalized recommendations. Disney+ supports 4K UHD streaming, offline downloads, and multiple simultaneous streams. The platform includes parental controls and family-friendly features, ensuring safe viewing experiences. Frequent updates introduce new content, improve streaming quality, and enhance navigation. Disney+ has become a leading entertainment service for families and fans of high-quality cinematic experiences worldwide.",
    "size": 150,
    "reviews": 3200000,
    "ratingAvg": 4.6,
    "downloads": 670,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1100000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://i.ibb.co/hR2ZBYhX/dima-solomin-s-OU09hn-ONr-Q-unsplash.jpg",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 20,
    "description": "Popular streaming service for movies and TV shows.",
    "des": "Netflix, developed by Netflix Inc., is a subscription-based streaming service providing movies, TV shows, documentaries, and original content to a global audience. Users can stream content on-demand across devices, create profiles, and receive personalized recommendations based on viewing habits. Netflix supports 4K UHD, HDR, offline downloads, and multiple simultaneous streams. The platform is known for producing award-winning original series and films while licensing content from studios worldwide. Security features, parental controls, and frequent updates enhance usability and user experience. Netflix’s extensive content library, accessibility, and user-centric approach have made it a dominant player in digital entertainment.",
    "size": 160,
    "reviews": 9000000,
    "ratingAvg": 4.6,
    "downloads": 2500,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 4350000 }
    ]
  },
  {
    "image": "https://i.ibb.co/dstdnRQ0/jas-rolyn-7-Bq-K0r-CPO5k-unsplash.jpg",
    "title": "Booking.com",
    "companyName": "Booking Holdings",
    "id": 21,
    "description": "Hotel booking and travel reservation platform.",
    "des": "Booking.com, developed by Booking Holdings, is an online travel platform that allows users to book hotels, vacation rentals, flights, and other travel-related services. It provides detailed information, photos, user reviews, and ratings to help travelers make informed decisions. Users can filter searches by location, price, amenities, and availability. Booking.com supports instant reservations, flexible cancellations, and loyalty rewards. Frequent updates improve the interface, search algorithms, and customer support features. The platform’s convenience, extensive listings, and user-focused services make it a leading solution for planning and booking travel worldwide.",
    "size": 85,
    "reviews": 2800000,
    "ratingAvg": 4.5,
    "downloads": 340,
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 140000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 1170000 }
    ]
  },
  {
    "image": "https://i.ibb.co/3yMdNPB5/appshunter-io-7-Ft-QKd-FXes-unsplash.jpg",
    "title": "Uber Eats",
    "companyName": "Uber",
    "id": 22,
    "description": "Food delivery app offering meals from local restaurants.",
    "des": "Uber Eats, developed by Uber, is a food delivery platform that connects users with local restaurants and food outlets. Users can browse menus, place orders, track delivery in real-time, and pay through secure digital methods. The platform supports promotions, ratings, and reviews, helping users discover new restaurants. Uber Eats provides delivery partners with optimized routing and efficient order management. Frequent updates enhance app performance, security, and usability. With its convenience, variety of options, and reliable service, Uber Eats has become a popular choice for on-demand food delivery worldwide.",
    "size": 95,
    "reviews": 4300000,
    "ratingAvg": 4.3,
    "downloads": 620,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 450000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 1250000 }
    ]
  },
  {
    "image": "https://i.ibb.co/pjPx4srv/ilgmyzin-m-SIFEZ8-WW1-M-unsplash.jpg",
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "id": 23,
    "description": "Language learning app with gamified lessons.",
    "des": "Duolingo, developed by Duolingo Inc., is a gamified language learning platform that allows users to learn over 40 languages through interactive lessons. The app uses bite-sized exercises, quizzes, and challenges to teach vocabulary, grammar, listening, and speaking skills. Duolingo incorporates gamification elements such as streaks, points, and rewards to motivate learners. It supports offline learning, adaptive difficulty, and personalized study plans. Frequent updates introduce new languages, exercises, and learning tools. Duolingo’s engaging, accessible, and effective approach has made it a leading platform for language education globally.",
    "size": 70,
    "reviews": 5200000,
    "ratingAvg": 4.8,
    "downloads": 890,
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 3230000 }
    ]
  },
  {
    "image": "https://i.ibb.co/RT1qhZrk/rubaitul-azad-J0eq-Dg-SQDYg-unsplash.jpg",
    "title": "Amazon",
    "companyName": "Amazon",
    "id": 24,
    "description": "Online marketplace for shopping and digital services.",
    "des": "Amazon, developed by Amazon, is a global e-commerce platform that allows users to shop for millions of products including electronics, clothing, books, and groceries. Users can browse listings, read reviews, compare prices, and make purchases with secure payment methods. Amazon supports features like fast delivery, subscription services (Prime), wish lists, and recommendations powered by AI. The platform also provides digital services like cloud storage, video streaming, and smart home integrations. Frequent updates enhance the shopping experience, app performance, and security. Amazon’s convenience, vast selection, and reliability have made it a dominant global marketplace.",
    "size": 155,
    "reviews": 14000000,
    "ratingAvg": 4.7,
    "downloads": 2300,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 4500000 },
      { "name": "5 star", "count": 7800000 }
    ]
  },
  {
    "image": "https://i.ibb.co/bgC0VTkx/rubaitul-azad-Ra2rr07zu-Fc-unsplash.jpg",
    "title": "Flipkart",
    "companyName": "Flipkart Ltd.",
    "id": 25,
    "description": "E-commerce shopping platform based in India.",
    "des": "Flipkart, developed by Flipkart Ltd., is a leading e-commerce platform in India that offers products across categories including electronics, fashion, home goods, and groceries. Users can browse, compare, and purchase items with secure payment options, track orders, and access discounts. Flipkart provides customer reviews, recommendations, and personalized offers. Its user-friendly interface, quick delivery services, and customer support ensure a seamless shopping experience. Frequent updates introduce new features, payment methods, and promotions. Flipkart has become a trusted online shopping destination for millions in India, combining convenience, variety, and reliability.",
    "size": 130,
    "reviews": 8000000,
    "ratingAvg": 4.4,
    "downloads": 1700,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 450000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 3450000 }
    ]
  },
  {
    "image": "https://i.ibb.co/VWZVCB79/shoope.jpg",
    "title": "Shopee",
    "companyName": "Shopee Ltd.",
    "id": 26,
    "description": "Shopping and online marketplace popular in Asia.",
    "des": "Shopee, developed by Shopee Ltd., is a popular online marketplace and shopping platform in Asia that connects buyers and sellers across a variety of product categories. Users can browse, search, and purchase products with secure payment options, track deliveries, and participate in promotions and flash sales. Shopee provides reviews, seller ratings, and personalized recommendations to enhance the shopping experience. The platform also offers in-app games and social features to increase engagement. Regular updates improve usability, security, and app performance. Shopee’s combination of convenience, competitive pricing, and diverse offerings has made it a widely used e-commerce platform in the region.",
    "size": 120,
    "reviews": 6000000,
    "ratingAvg": 4.5,
    "downloads": 1400,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 2900000 }
    ]
  },
  {
    "image": "https://i.ibb.co/4w7MH9d8/eyestetix-studio-rq-DHdr-KIJs-unsplash.jpg",
    "title": "Telegram X",
    "companyName": "Telegram",
    "id": 27,
    "description": "Faster experimental version of Telegram.",
    "des": "Telegram X, developed by Telegram, is an experimental version of Telegram designed to provide faster performance and smoother animations. It supports all core features of Telegram, including cloud-based messaging, multimedia sharing, group chats, channels, and bots. Telegram X emphasizes speed, optimized battery usage, and lightweight performance on devices. Security features such as secret chats, end-to-end encryption, and privacy controls ensure secure communication. Regular updates improve usability, introduce new features, and enhance the overall messaging experience. Telegram X is popular among users seeking a faster, efficient alternative to the standard Telegram app.",
    "size": 55,
    "reviews": 2000000,
    "ratingAvg": 4.5,
    "downloads": 310,
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "image": "https://i.ibb.co/LytKCdP/mariia-shalabaieva-Jk-Zg8c61-Bo-U-unsplash.jpg",
    "title": "Notion",
    "companyName": "Notion Labs",
    "id": 28,
    "description": "Notes, tasks, wiki, and project management in one.",
    "des": "Notion, developed by Notion Labs, is an all-in-one productivity platform that combines notes, tasks, wikis, and project management tools. Users can create and organize pages, databases, calendars, and kanban boards, collaborating with teams or working individually. Notion supports rich text editing, multimedia integration, templates, and real-time collaboration. It integrates with various tools, enabling workflow automation and data centralization. Regular updates introduce new features, improve usability, and enhance performance. Notion’s flexibility, intuitive interface, and collaborative features make it an essential platform for productivity, knowledge management, and project organization.",
    "size": 85,
    "reviews": 2700000,
    "ratingAvg": 4.8,
    "downloads": 520,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1520000 }
    ]
  }
]
